Repository: 84000/data-translation-memory
Catalog: toh285-v2.tmx
Source language: bo
Languages: en

source: ༄༅། །འཕགས་པ་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཞེས་བྱ་བའི་ཡོངས་སུ་བསྔོ་བ།
en: The Noble Dedication Fulfilling All Aspirations

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཞབས་དང་། ཆོས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་མགོ་བོས་ཕྱག་འཚལ་ལོ། །
en: I bow my head at the feet of all the Buddhas, to the Teaching, and to the Assembly of fully ordained monks.

source: ཕྱོགས་བཅུ་བརྗོད་ཀྱིས་མི་ལང་བའི་འཇིག་རྟེན་གྱི་ཁམས་ན་བཞུགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་། ས་ཆེན་པོར་ཆུད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་བདག་ལ་དགོངས་སུ་གསོལ།
en: Blessed buddhas residing in the inexpressibly many world systems of the ten directions, and bodhisattva great beings who have entered the higher stages of complete awakening, please pay heed to me!

source: གང་བདག་གིས་སྐྱེ་བ་འདི་དང་། སྐྱེ་བ་གཞན་དུ་ན་ཁྱིམ་པའམ། རབ་ཏུ་བྱུང་བ་ཇི་ཙམ་དུ་འཁོར་བའི་སྔོན་གྱི་མཐའ་མ་འཚལ་བ་ནས། སྡིག་པ་མི་དགེ་བའི་ལས་བགྱིས་ཤིང་བསགས་པ།
en: Whatever sins and nonvirtuous actions I have committed and accumulated from cyclic existence’s undiscoverable beginning, in this life and in other lives, as a householder and as a renunciant—

source: ལུས་དང་། ངག་དང་། ཡིད་ཀྱིས་བགྱིས་པ་དང་།
en: what I have done physically, verbally, and mentally;

source: བགྱིད་དུ་སྩལ་བ་དང་། བགྱིད་པ་ལ་རྗེས་སུ་ཡི་རང་བ་ཤེས་པའམ། མི་ཤེས་པའམ། བསམས་པའམ། མ་བསམས་པའམ། དྲན་པའམ། མི་དྲན་པའམ།
en: what I have exhorted others to do and what I have rejoiced in others doing; what I have done knowingly or unknowingly, intentionally or unintentionally, and what I have remembered or forgotten;

source: འདོད་ཆགས་ཀྱི་དབང་ངམ། ཞེ་སྡང་གི་དབང་ངམ། གཏི་མུག་གི་དབང་ངམ། དགེ་བའི་བཤེས་གཉེན་མ་ལགས་པ་དང་འབྲེལ་བའི་དབང་ངམ། མི་ཤེས་པའི་དབང་ངམ། ཡུལ་གྱི་དབང་ངམ། དུས་སུ་སྐྱེ་བའི་དབང་ངམ། ཡང་དག་པའི་ཚུལ་ཁྲིམས་འཆལ་པའམ། སྦྱོར་བས་ཚུལ་ཁྲིམས་འཆལ་པའམ། དངོས་པོས་ཚུལ་ཁྲིམས་འཆལ་པའམ།
en: what I have done under the influence of desire, under the influence of anger, under the influence of ignorance, under the influence of relationships with those who are not virtuous spiritual friends, under the influence of ignorance, under the influence of place, and under the influence of birth at a particular time; violations of proper ethics, violations of ethical rules, and violations of natural ethics;

source: ལུས་ཀྱི་རྣམ་གསུམ་དང་། ངག་གི་རྣམ་བཞི་དང་། ཡིད་ཀྱི་རྣམ་གསུམ་གྱིས་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་དང་། ཕ་མ་དང་། མཁན་པོ་དང་། སློབ་དཔོན་ནམ། བླ་མ་གཞན་དག་ལ་ཉེས་པ་བགྱིས་པའམ།
en: the faults I have engaged in toward the Buddha, the Teaching, the Assembly, my father and mother, my abbot, my spiritual master, or other teachers through the three kinds of physical wrongdoing, the four kinds of verbal wrongdoing, and the three kinds of mental wrongdoing;

source: སེམས་ཅན་གྱི་ཁམས་ལྟ་བ་ལོག་པ་ལ་བཙུད་པའམ། སེམས་ཅན་ཡང་དག་པ་སྒྲུབ་པ་ལ་གནས་པ་རྣམས་ཀྱི་བར་ཆད་བགྱིས་པའམ།
en: turning sentient beings toward perverted views; creating obstacles for sentient beings engaged in proper practice;

source: དགེ་བའི་རྩ་བ་རྣམས་ལོག་པར་སྔོ་བས་ཡོངས་སུ་བསྔོས་པའམ། དེ་བཞིན་གཤེགས་པ་ལ་ཡང་དག་པ་མ་ཡིན་པ་སྨྲས་པའམ།
en: dedicating my roots of virtue incorrectly; speaking falsely to a tathāgata;

source: ཆོས་ཆོས་མ་ཡིན་པ་ཆོས་སུ་བསྟན་པའམ། ཆོས་ཆོས་མ་ཡིན་པར་བསྟན་པའམ། འདུལ་བ་མ་ཡིན་པ་འདུལ་བར་བསྟན་པའམ། འདུལ་བ་འདུལ་བ་མ་ཡིན་པར་བསྟན་པའམ། ལམ་མ་ཡིན་པ་ལམ་དུ་བསྟན་པའམ། ལམ་ལམ་མ་ཡིན་པར་བསྟན་པའམ།
en: teaching non-Dharma as Dharma and teaching Dharma as non-Dharma; teaching what is not the vinaya as the vinaya and teaching the vinaya as not the vinaya; teaching what is not the path as the path and teaching what is the path as not the path;

source: སྒྲིབ་པ་གང་གིས་བསྒྲིབས་ནས་བདག་མི་དགེ་བའི་ཆོས་མངོན་དུ་འགྱུར་ཞིང་དགེ་བའི་ཕྱོགས་ལ་སེམས་ཡང་དག་པར་མི་གནས་པའམ།
en: that, clouded by whichever obscurations, I gave rise to nonvirtuous qualities and did not establish my mind properly in virtue;

source: སྒྲིབ་པ་གཞན་གྱིས་བསྒྲིབས་ནས་བློ་གཡེང་བར་འགྱུར་བའམ། སེམས་གཡེང་བར་འགྱུར་བའི་ནོངས་པ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་ནོངས་པ་བཤགས་པར་བགྱིའོ། །
en: that, clouded by other obscurations, I was distracted and mentally agitated—all such faults I confess.

source: ཇི་ལྟར་བྱིས་པ། ཇི་ལྟར་བླུན་པ། ཇི་ལྟར་མི་གསལ་བ། ཇི་ལྟར་མི་མཁས་པ། ཇི་ལྟར་འཆལ་པའི་ཤེས་རབ་ཀྱི་རང་བཞིན་ཅན་དེ་ལྟར་ནོངས་པ་ནོངས་པར་བཤགས་པར་བགྱིའོ། །
en: In whatever ways I was childish, in whatever ways foolish, in whatever ways confused, in whatever ways unwise, and in whatever ways misguided—all such faults I confess as faults.

source: ནོངས་པ་ནོངས་པར་བཤགས་ནས་ཕྱིས་སྡོམ་པ་བླངས་ཤིང་ཡང་དེ་ལྟར་མི་བགྱི་སྟེ།
en: Having confessed those faults as faults, I vow that in the future I will not act in such ways again.

source: དེ་ལྟར་ལན་གཉིས་དེ་ལྟར་ལན་གསུམ་དུའོ། །
en: Thus I recite a second time, and thus a third time.

source: ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་བདག་ལ་དགོངས་སུ་གསོལ།
en: Again, blessed buddhas, please pay heed to me!

source: གང་སངས་རྒྱས་ཐམས་ཅད་སྔོན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་རྣམས་ཀྱིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་མཛད་པ་འདི་ལྟ་སྟེ། སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་
en: I rejoice that all the buddhas who formerly were bodhisattvas completely accomplished the six perfections, which is to say that they completely and manifestly awakened to unexcelled, perfect, complete enlightenment by means of generosity, ethical discipline, endurance, diligence, meditative absorption, and wisdom;

source: ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར། ཆོས་ཀྱི་དུང་ཀུན་ནས་བུས། ཆོས་ཀྱི་རྔ་རབ་ཏུ་བརྡུངས། ཆོས་ཀྱི་སྒྲོན་མ་འབར་བར་མཛད།
en: that they turned the wheel of the Dharma, blew the conch of the Dharma, beat the drum of the Dharma, and set ablaze the lamp of the Dharma;

source: ཆོས་དང་འཐུན་པར་ཆོས་སྒྲུབ་པ་དག་ལ་སེམས་ཅན་གྱི་ཁམས་རབ་ཏུ་བཙུད།
en: that they led the mass of sentient beings to the practice of the Dharma in accordance with the Dharma;

source: དམ་པའི་ཆོས་ཀྱི་ཚུལ་རབ་ཏུ་བསྟན་ཅིང་དགེ་བའི་རྩ་བ་གང་གིས་རང་སངས་རྒྱས་རྣམས་རང་སངས་རྒྱས་ཉིད་རྟོགས་པར་འགྱུར་བ་དང་།
en: and that they taught the methods of the holy Dharma—and I rejoice in the roots of virtue by which the pratyekabuddhas realized the state of a pratyekabuddha;

source: དགེ་བའི་རྩ་བ་གང་གིས་ཉན་ཐོས་རྣམས་ཉན་ཐོས་ཉིད་རྟོགས་པར་འགྱུར་ཞིང་རིག་པ་གསུམ་དང་། མངོན་པར་ཤེས་པ་དྲུག་རྟོགས་པར་འགྱུར་བ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་མངོན་དུ་འགྱུར་ཞིང་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དང་།
en: [I rejoice ...] in the roots of virtue by which the śrāvakas realized the state of a śrāvaka, realized the three knowledges and the six superknowledges, and manifested discernment, the meditative absorptions, the liberations, the meditative concentrations, and the meditative attainments;

source: དགེ་བའི་རྩ་བ་གང་གིས་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་ལས་ཡང་དག་པར་འདའ་བ་དང་།
en: [I rejoice ...] in the roots of virtue by which sentient beings completely overcome falling into the lower, infernal realms of the hells, the realms of animals, and the realm of the Lord of the Dead;

source: འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཉོན་མོངས་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པ་སྤོང་བ་དང་། ཚེ་རིང་བ་དང་། གནོད་པ་ཆུང་བ་དང་། མདོག་བཟང་བ་དང་། གཟུགས་བཟང་བ་དང་། གཟི་བརྗིད་ཆེ་བ་དང་། དབང་ཆེ་བ་དང་། རིགས་མཐོ་བ་དང་། ལོངས་སྤྱོད་ཆེ་བ་དང་། ཤེས་རབ་ཆེ་བ་དང་། མི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་སྤངས་པ་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་དང་ལྡན་པ་དང་། ཐ་ན་ཕྱག་གཅིག་འཚལ་བ་དང་། ཐལ་མོ་གཅིག་སྦྱོར་བ་དང་། མེ་ཏོག་གཅིག་འབུལ་བ་དང་། སེམས་དང་བ་གཅིག་ཙམ་སྐྱེད་པའི་སེམས་ཅན་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་ལ་རྗེས་སུ་ཡི་རང་སྟེ།
en: in their abandoning of the primary afflictions of desire, anger, and ignorance and the secondary afflictions; in their longevity, health, good complexions, excellent figures, great splendor, great power, high status, great wealth, and great wisdom; in their abandoning of all roots of nonvirtue and the possession of all roots of virtue; and in even as little as a single prostration, joining the palms for prayer even a single time, the offering of a single flower, and sentient beings who give rise to just a single moment of faith—in all of these things I rejoice!

source: རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་ངོ་། །
en: Supremely pleased I rejoice!

source: གཙོ་བོ་དང་། དམ་པ་དང་། རབ་དང་། ཕུལ་དང་། བླ་ན་མ་མཆིས་པ་དང་། གོང་ན་མ་མཆིས་པ་དང་། གོང་མའི་ཡང་གོང་མ་དང་། མཉམ་པ་མ་མཆིས་པ་དང་། མི་མཉམ་པ་དང་མཉམ་པ་དང་། མཚུངས་པ་མ་མཆིས་པ་དང་། ནམ་མཁའ་ལྟར་དག་ཅིང་ཡོངས་སུ་དག་པའི་རྗེས་སུ་ཡི་རང་བས་རྗེས་སུ་ཡི་རང་ངོ་། །
en: I rejoice with rejoicing that is most excellent, supreme, best, perfect, unsurpassed, highest, even higher than the highest, unequaled, equal to the unequaled, matchless, and pure, completely pure like the sky.

source: གང་དག་གིས་ཆོས་ཐམས་ཅད་ཡང་དག་པར་ཐུགས་སུ་ཆུད་ནས་ཆོས་ལ་དགྱེས་པ་དང་། ཆོས་ལ་ངེས་པ་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་སྐྱེད་པ་དང་། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པ་དང་། ཡོན་ཏན་ཐམས་ཅད་ཡོངས་སུ་སྐྱོང་ཞིང་ཡོངས་སུ་བསྔོ་བ་དང་།
en: [I exhort those] who, having understood all of the holy Dharma, know how to delight in the Dharma, how to discern the Dharma, how to generate all roots of virtue, how to protect all beings, and how to nurture and dedicate all good qualities;

source: ཆོས་ཀྱི་ཕུང་པོ་སྟོང་ཕྲག་ཀུན་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་དམ་བཅས་པ་དང་། སྨོན་ལམ་དང་། ཟག་པ་ཟད་པ་ཤེས་པ་དང་། སྣོན་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། རང་བཞིན་ཤེས་པ་ཡང་དག་པར་ཐུགས་སུ་ཆུད་ལ།
en: [I exhort those] who know all the thousands of compilations of the Dharma, and all the meditative absorptions, liberations, meditative concentrations, and meditative attainments; who know the vows, the prayers, and the exhaustion of defilements; who know beings’ intentions, latent dispositions, temperament, and intrinsic nature and understand them correctly;

source: ཆུད་ནས་ཀྱང་སེམས་ཅན་གྱི་ཁམས་བཀའ་བློ་མི་བདེ་བར་མཁྱེན་ནསཐུགས་ཁྲལ་ཆུང་ངུར་ཐུགས་འཇོག་པར་མཛད་ཅིང་། ཆོས་སྟོན་པར་མི་མཛད་པ་དེ་དག་ལ་བདག་སྐུལ་མ་འདེབས་ཏེ།
en: yet who, having that understanding, also know that sentient beings do not delight in instruction, and so remain at ease, rest their minds and do not teach the Dharma—I exhort them!

source: སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོའི་ཚོགས་མང་པོའི་དོན་དང་། ལྷ་དང་། མི་རྣམས་ལ་སྨན་པ་དང་། བདེ་བའི་སླད་དུ་དམ་པའི་ཆོས་བཤད་དུ་གསོལ།
en: For the benefit of the many, for the happiness of the many, out of compassion for the world, for the sake of the many masses of beings, and for the benefit and happiness of gods and humans, I entreat them to explain the holy Dharma.

source: ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་དུ་གསོལ།
en: I entreat them to turn the wheel of the Dharma.

source: ཆོས་ཀྱི་དུང་ཀུན་ནས་བུད་དུ་གསོལ།
en: I entreat them to blow the conch of the Dharma.

source: ཆོས་ཀྱི་རྔ་བརྡུང་དུ་གསོལ།
en: I entreat them to beat the drum of the Dharma.

source: ཆོས་ཀྱི་སྒྲོན་མ་འབར་བར་མཛད་དུ་གསོལ།
en: I entreat them to set the lamp of the Dharma ablaze.

source: ཆོས་དང་འཐུན་པར་ཆོས་སྒྲུབ་པ་དག་ལ་སེམས་ཅན་གྱི་ཁམས་རབ་ཏུ་དགོང་དུ་གསོལ།
en: I entreat them to establish the mass of sentient beings in the practice of the Dharma in accordance with the Dharma.

source: གང་དག་ཚེ་ལ་དབང་བ། སྤྲུལ་པ་ལ་དབང་བ། བྱིན་གྱི་རླབས་ལ་དབང་བ། རྫུ་འཕྲུལ་ལ་དབང་བ། སེམས་ཅན་གདུལ་བའི་ཚོགས་སྨིན་པར་མཛད་པ་དབང་དུ་གྱུར་པ། དབང་དུ་མ་གྱུར་པ་རྣམས་ལ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་ཐུགས་གཞོལ་ཞིང་སྐུ་ཚེ་འདོར་བར་མཛད་པ་དེ་དག་ལ་བདག་གསོལ་བ་འདེབས་ཏེ
en: I entreat those who have gained mastery over life, mastery of emanation, mastery of blessing, and mastery of miraculous power; those who have and have not gained mastery of ripening the mass of sentient beings to be trained, who have forsaken life, intending to enter final nirvāṇa—I entreat them.

source: སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོའི་ཚོགས་མང་པོའི་དོན་དང་། ལྷ་དང་མི་རྣམས་ལ་སྨན་པ་དང་། བདེ་བའི་སླད་དུ་སྐུ་ཚེའི་འདུ་བྱེད་རྣམས་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།
en: For the benefit of the many, for the happiness of the many, out of compassion for the world, for the sake of the many masses of beings, and for the benefit and happiness of gods and humans, I entreat them to grant the blessing of the conditions for their longevity.

source: གང་བདག་གིས་འཁོར་བའི་སྔོན་གྱི་མཐའ་མ་འཚལ་བ་ནས་དགེ་བའི་རྩ་བ་བགྱིས་ཤིང་བསགས་པ་ལུས་དང་། ངག་དང་། ཡིད་ཀྱིས་བགྱིས་པ་དང་། བགྱིད་དུ་སྩལ་བ་དང་། བགྱིད་པ་ལ་རྗེས་སུ་ཡི་རང་བ་
en: [I dedicate] whatever roots of virtue I have created and accumulated from cyclic existence’s undiscoverable beginning—what I have done physically, verbally, and mentally; what I have exhorted others to do and what I have rejoiced in others doing;

source: སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དང་། ཚུལ་ཁྲིམས་ལས་བྱུང་བ་དང་། བསྒོམས་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དང་། ཐ་ན་སེམས་ཅན་གཅིག་གི་སེམས་དང་བ་གཅིག་ཙམ་བསྐྱེད་པར་གྱུར་པ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་སེམས་ཅན་ཐམས་ཅད་ལ་ཡོངས་སུ་བསྔོ་བར་བགྱིའོ། །
en: meritorious deeds arisen from generosity; meritorious deeds arisen from ethical discipline; meritorious deeds arisen from meditation; and even causing just a single sentient being to give rise to a single moment of faith—all of these I dedicate to all sentient beings.

source: དགེ་བའི་རྩ་བ་འདིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །
en: By these roots of virtue may all the roots of virtue of all sentient beings be completely perfected!

source: ཚེ་རིང་བ་དང་། གནོད་པ་ཆུང་བ་དང་། མདོག་བཟང་བ་དང་། གཟུགས་བཟང་བ་དང་། གཟི་བརྗིད་ཆེ་བ་དང་། དབང་ཆེ་བ་དང་། རིགས་མཐོ་བ་དང་། ལོངས་སྤྱོད་ཆེ་བ་དང་། ཤེས་རབ་ཆེ་བ་དང་། རྫས་དང་། སྔགས་དང་། སྨན་རྙེད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་དང་ཕྲད་པ་དང་དམ་པའི་ཆོས་ཉན་པ་དང་། ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་དང་། ཆོས་དང་འཐུན་པའི་ཆོས་སྒྲུབ་པ་དང་། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཉོན་མོངས་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པ་སྤོང་བ་དང་། སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་ལས་ཡང་དག་པར་འདའ་བ་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ཐོབ་པ་དང་། ལུས་ལས་བྱུང་བ་དང་། སེམས་ལས་བྱུང་བའི་ཡིད་མི་བདེ་བ་ལས་ཡང་དག་པར་འདའ་བ་དང་། བདེ་བ་དང་། ཡིད་བདེ་བ་ཐམས་ཅད་འཐོབ་པ་དང་། ཉན་ཐོས་ཀྱི་ཡོན་ཏན་གྱི་མཆོག་ཉིད་དང་། རང་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་གྱི་མཆོག་ཉིད་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བརྒྱད་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་དང་། བག་ཆགས་འཇོམས་པ་དང་། བསྙེལ་བ་མི་མངའ་བའི་ཆོས་ཉིད་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་། ཡེ་ཤེས་མི་ཟད་པ་ཉིད་དང་། ཤེས་རབ་མི་ཟད་པ་ཉིད་དང་། སྤོབས་པ་མི་ཟད་པ་ཉིད་དང་། བསོད་ནམས་མི་ཟད་པ་ཉིད་དང་། ནམ་མཁའི་མཛོད་ཉིད་དང་། ལག་ན་རིན་པོ་ཆེ་ཉིད་དང་། བླ་ན་མེད་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་འཐོབ་པ་དང་། གཞན་ཡང་འཇིག་རྟེན་དང་། འཇིག་རྟེན་ལས་འདས་པའི་དགེ་བའི་རྩ་བ་གང་དང་གང་ལགས་པ་དེ་དག་སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་དག་པར་གྲུབ་པར་གྱུར་ཅིག །
en: Having a long life, health, a good complexion, an excellent figure, great splendor, great power, high status, great wealth, great wisdom, possessions, magic spells, and medicine; encountering virtuous spiritual friends; listening to the holy Dharma; directing the mind appropriately; the practice in accordance with the Dharma; the abandoning of the primary afflictions of desire, anger, and ignorance as well as the secondary afflictions; completely overcoming falling into the lower, infernal realms of the hells, the realms of animals, and the realm of the Lord of the Dead; attaining all the meditative absorptions, liberations, meditative concentrations, and meditative attainments; completely overcoming physical and mental unhappiness; attaining all bliss and happiness; attaining the excellence of the enlightened attributes of the śrāvakas, the excellence of the enlightened attributes of the pratyekabuddhas, the ten powers of the tathāgatas, the four states of fearlessness, the four discernments, the eighteen distinctive qualities of a buddha, great loving kindness, great compassion, great joy, great equanimity, the vanquishing of the latent tendencies, the state of non-forgetfulness, the state of omniscience, the state of the knowledge of all aspects, the state of inexhaustible wisdom, the state of inexhaustible knowledge, the state of inexhaustible courage, the state of inexhaustible merit, the state of the sky treasury, the state of the jewel holder, and the unsurpassed wisdom of omniscience; and whatever mundane and transcendent roots of virtue there are—may all of these come to be for all sentient beings!

source: གང་སེམས་ཅན་ཐམས་ཅད་ལ་དགེ་བའི་རྩ་བ་བསྔོ་བ་བགྱིས་པ་དགེ་བའི་རྩ་བ་བསྔོས་པ་དེ་ལས་བསོད་ནམས་ཀྱི་འབྲས་བུ་ཡོད་པ་གང་ལགས་པའི་དགེ་བའི་རྩ་བ་འདིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས།
en: Whatever fruit there may be from the merit of dedicating my roots of virtue to all sentient beings, by the roots of virtue of having so dedicated them, having completely and manifestly awakened to unexcelled, perfect, complete enlightenment,

source: སེམས་ཅན་མ་རྒལ་བ་རྣམས་ནི་བསྒྲལ་བར་བགྱིའོ། །
en: may I ferry those sentient beings across who have not crossed over,

source: མ་གྲོལ་བ་རྣམས་ནི་དགྲོལ་བར་བགྱིའོ། །
en: may I liberate those who are not yet liberated,

source: དབུགས་མ་ཕྱིན་པ་རྣམས་ནི་དབུགས་དབྱུང་བར་བགྱིའོ། །
en: may I give relief to those who are unrelieved,

source: མྱ་ངན་ལས་མ་འདས་པ་རྣམས་ནི་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བར་བགྱིའོ། །
en: may I cause all those who have not entered nirvāṇa to enter final nirvāṇa, and

source: སྨན་པ་དང་བདེ་བའི་མཐའི་གནས་ཀྱི་གཞི་ལ་རབ་ཏུ་དགོད་པར་བགྱི་སྟེ།
en: may I establish them in the realm of ultimate benefit and bliss!

source: དེ་ལྟར་ལན་གཉིས་ལན་གསུམ་དུའོ། །
en: Thus I recite a second time, and thus a third time.

source: འཕགས་པ་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཞེས་བྱ་བའི་ཡོངས་སུ་བསྔོ་བ་རྫོགས་སོ། །
en: The Noble Dedication “Fulfilling All Aspirations” is concluded.
